import tensorflow as tf
from keras.models import load_model
# global graph, model, output_list

graph = tf.get_default_graph()
model = load_model('plant_app/AlexNetModel.hdf5')#这里修改预训练文件

output_dict = {
'苹果___苹果锈病': 0,
'苹果___黑腐病': 1,
'苹果___雪松苹果锈病': 2,
'苹果___健康': 3,
'蓝莓___健康': 4,
'樱桃___白粉病': 5,
'樱桃___健康': 6,
'玉米___叶斑病 灰叶斑病': 7,
'玉米___普通锈病': 8,
'玉米___北方叶枯病': 9,
'玉米___健康': 10,
'葡萄___黑腐病': 11,
'葡萄___黑霉病': 12,
'葡萄___叶枯病': 13,
'葡萄___健康': 14,
'橙子___黄龙病': 15,
'桃子___细菌性斑点病': 16,
'桃子___健康': 17,
'甜椒___细菌性斑点病': 18,
'甜椒___健康': 19,
'土豆___早疫病': 20,
'土豆___晚疫病': 21,
'土豆___健康': 22,
'覆盆子___健康': 23,
'大豆___健康': 24,
'南瓜___白粉病': 25,
'草莓___叶焦病': 26,
'草莓___健康': 27,
'番茄___细菌性斑点病': 28,
'番茄___早疫病': 29,
'番茄___晚疫病': 30,
'番茄___叶霉病': 31,
'番茄___叶斑病': 32,
'番茄___蜘蛛螨（二斑叶螨）': 33,
'番茄___靶斑病': 34,
'番茄___番茄黄化曲叶病毒': 35,
'番茄___番茄花叶病毒': 36,
'番茄___健康': 37}

output_list = list(output_dict.keys())
